[
    {
      "id": "624b4f68fe1ca2833a82b519",
      "name": "Ollie James",
      "profile_picture": "https://i.ibb.co/bNdHHQs/5.jpg",
      "email": "olliejames@buzzworks.com",
      "product_name": "Apple AirPods Pro",
      "review_heading": "Airpods have never been better!",
      "review": "These little things pack one hell of a punch!\n Apple’s new noise cancellation and transparency modes lay the groundwork for a new generation of wireless headphones. Yes others may have used similar technology before, but Apple’s simplistic UI made for the airpods pro make the experience so much better than what other companies offer. \n Coming from the first generation airpods, the experience is like night and day. Even though the airpods themselves are heavier, they feel lighter in the ears and much more comfortable. The audio quality is insane, and this quality is only amplified by Apple’s new spatial audio.\r\n",
      "registered": "18-03-2018",
      "ratings": 5
    },
    {
      "id": "624b4f681952293340ac2c9f",
      "name": "Virginia Bradford",
      "profile_picture": "https://i.ibb.co/vBRQX0J/3.jpg",
      "email": "virginiabradford@buzzworks.com",
      "product_name": "JVC HARX700 Precision Sound Full Size Headphones - Black",
      "review_heading": "Well for 6 month these were great headphones",
      "review": "Well for 6 month these were great headphones....Then the left driver blew with normal use...I took a look on the inside and it was obvious why. Although the outer shell is made well, the innards are of very poor quality. Sub-standard drivers, badly soldered connections and cheap wire (the only thing keeping the wire from pulling loose is the fact that it is tied in a knot inside the housing.\r\n",
      "registered": "03-12-2022",
      "ratings": 2
    },
    {
      "id": "624b4f68c256b41b6dd6e1cc",
      "name": "Wilkins Kirkland",
      "profile_picture": "https://i.ibb.co/YpnW4Fq/2.jpg",
      "email": "wilkinskirkland@buzzworks.com",
      "product_name": "Koss KPH7 Lightweight Portable Headphone, Black",
      "review_heading": "Incredible bargain",
      "review": "I love mines. For £4 shipped I wasn't expecting much, but these babies are well built and actually sound decent even for music! I could listen all day long. No buzzing in the drivers like junk headphones. They are not very sensitive so you have to crank the volume up a little more than other headphones. Especially for children, youtube etc these are winners! \n They weigh nothing and are very comfortable, bravo KOSS!\r\n",
      "registered": "27-03-2021",
      "ratings": 5
    },
    {
      "id": "624b4f68e072e2b1e307450c",
      "name": "Debra Mccarty",
      "profile_picture": "https://i.ibb.co/Pzhf4Xj/6.jpg",
      "email": "debramccarty@buzzworks.com",
      "product_name": "Skullcandy Riff Wireless On-Ear Headphone, Grey",
      "review_heading": "Don't believe it won't happen to you",
      "review": "I read some of the comments about the head piece being flimsy and breaking easily, but I thought it was probably people who wasn't careful enough, so I bought these, I even bought a case to carry them around, and after a couple months the head piece just broke, which is a shame, since I liked everything else about it. \n Just save the money you were to invest, and the money from any case you would buy, and purchase another product instead\r\n",
      "registered": "31-12-2019",
      "ratings": 1
    },
    {
      "id": "624b4f68478c1760903f8dfe",
      "name": "Elliott Cotton",
      "profile_picture": "https://i.ibb.co/XjH4gFg/4.jpg",
      "email": "elliottcotton@buzzworks.com",
      "product_name": "Sony ZX Series Wired On-Ear Headphones, Black MDR-ZX110",
      "review_heading": "Love the look of these and the sound quality is ...",
      "review": "Love the look of these and the sound quality is good, particularly for the price. I have a small-ish head size and these boxed my ears so bad the first week I wore them. Ouch! Another reviewer mentioned to stretch them out by leaving them around a sofa armrest or something like that, and after doing that, I haven't had any trouble with my ears hurting.\r\n",
      "registered": "29-10-2020",
      "ratings": 4
    },
    {
      "id": "624b4f68c8626dd5b1cd0433",
      "name": "Abigail Joyce",
      "profile_picture": "https://i.ibb.co/T8KHg72/7.jpg",
      "email": "abigailjoyce@buzzworks.com",
      "product_name": "Audio-Technica ATH-M50xBT2 Wireless Over-Ear Headphones",
      "review_heading": "Sound Great, Really Uncomfortable",
      "review": "Don't buy these with intentions to use them for long periods of time, as they barely make it around my ears and hurt both my ears and the top of my head. I bought these intending to plug them into my guitar amp in order to listen to myself playing without bothering the family and neighbors. These are used as my secondary pair of headphones and are currently plugged into my Focusrite audio interface for my AT2020. My main pair of headphones are Razer Kraken Tournament Edition, of which are the second pair I've purchased, though I'm looking to soon replace them with some decent lightweight wireless headphones. This pair of headphones feel like a real waste of money.\r\n",
      "registered": "29-01-2022",
      "ratings": 3
    }
  ]